from dataclasses import dataclass

from django.contrib.auth import get_user_model

from user.parse_data import get_list_all_countries
from policy.parse_languages import get_country_list


@dataclass
class DataStorage:
    LANGUAGES_LIST = get_country_list()
    USER_MODEL = get_user_model()
    COUNTRIES_LIST = get_list_all_countries()
    IS_SITE_EXISTS_CHOICE = (
        ("Так", "Так"),
        ("Ні", "Ні")
    )
    COMPANIES_NICHE = [
        ('Краса', 'Краса'),
        ('Мода', 'Мода'),
        ('Товари для дому', 'Товари для дому'),
        ('Подорожі', 'Подорожі'),
        ('Їжа і напої', 'Їжа і напої'),
        ('Вироби своїми руками і ремесло', 'Вироби своїми руками і ремесло'),
        ("Здоров'я і фітнес", "Здоров'я і фітнес"),
        ('Освіта', 'Освіта'),
        ('Дизайн і мистецтво', 'Дизайн і мистецтво'),
        ('Організація заходів', 'Організація заходів'),
        ('Інше', 'Інше')
    ]
    COMPANIES_AIM = [
        ("Продати більше товарів", "Продати більше товарів"),
        ("Створити більше лідів для компанії", "Створити більше лідів для компанії"),
        ("Збільшити трафік на свій сайт", "Збільшити трафік на свій сайт"),
        ("Створити контент на Pinterest щоб розширити аудиторію",
         "Створити контент на Pinterest щоб розширити аудиторію"),
        ("Підвищити впізнаваність бренду", "Підвищити впізнаваність бренду"),
        ("Поки не знаю", "Поки не знаю")
    ]
    COMPANIES_DESCRIPTION = [
        ("Не можу сказати точно", "Не можу сказати точно"),
        ("Блогер", "Блогер"),
        ("Товари, продукти чи послуги", "Товари, продукти чи послуги"),
        ("Підрядник чи доставник послуг", "Підрядник чи доставник послуг"),
        ("Автор, лідер думок, громадський діяч чи знаменитість",
         "Автор, лідер думок, громадський діяч чи знаменитість"),
        ("Місцевий роздрібний магазин чи компанія",
         "Місцевий роздрібний магазин чи компанія"),
        ("Роздрібний онлайн-магазин чи майданчик для онлайн-торгівлі",
         "Роздрібний онлайн-магазин чи майданчик для онлайн-торгівлі"),
        ("Видавник чи представник ЗМІ", "Видавник чи представник ЗМІ"),
        ("Інше", "Інше")
    ]

    START_ADD_CHOICE = [
        (1, "Так, мене цікавить реклама"),
        (2, "Ні, мене не цікавить реклама"),
        (3, "Ще не знаю")
    ]
