from dataclasses import dataclass

from django.contrib.auth import get_user_model

from user.parse_data import get_list_all_countries
from policy.parse_languages import get_country_list


@dataclass
class DataStorage:
    LANGUAGES_LIST = get_country_list()
    USER_MODEL = get_user_model()
    COUNTRIES_LIST = get_list_all_countries()
    IS_SITE_EXISTS_CHOICE = (
        ("1", "Так"),
        ("0", "Ні")
    )
    COMPANIES_NICHE = [
        ('1', 'Краса'),
        ('2', 'Мода'),
        ('3', 'Товари для дому'),
        ('4', 'Подорожі'),
        ('5', 'Їжа і напої'),
        ('6', 'Вироби своїми руками і ремесло'),
        ("7", "Здоров'я і фітнес"),
        ('8', 'Освіта'),
        ('9', 'Дизайн і мистецтво'),
        ('10', 'Організація заходів'),
        ('11', 'Інше')
    ]
    COMPANIES_AIM = [
        ("1", "Продати більше товарів"),
        ("2", "Створити більше лідів для компанії"),
        ("3", "Збільшити трафік на свій сайт"),
        ("4", "Створити контент на Pinterest щоб розширити аудиторію"),
        ("5", "Підвищити впізнаваність бренду"),
        ("6", "Поки не знаю")
    ]
    COMPANIES_DESCRIPTION = [
        ("Не можу сказати точно", "Не можу сказати точно"),
        ("Блогер", "Блогер"),
        ("Товари, продукти чи послуги", "Товари, продукти чи послуги"),
        ("Підрядник чи доставник послуг", "Підрядник чи доставник послуг"),
        ("Автор, лідер думок, громадський діяч чи знаменитість",
         "Автор, лідер думок, громадський діяч чи знаменитість"),
        ("Місцевий роздрібний магазин чи компанія",
         "Місцевий роздрібний магазин чи компанія"),
        ("Роздрібний онлайн-магазин чи майданчик для онлайн-торгівлі",
         "Роздрібний онлайн-магазин чи майданчик для онлайн-торгівлі"),
        ("Видавник чи представник ЗМІ", "Видавник чи представник ЗМІ"),
        ("Інше", "Інше")
    ]

    START_ADD_CHOICE = [
        (1, "Так, мене цікавить реклама"),
        (2, "Ні, мене не цікавить реклама"),
        (3, "Ще не знаю")
    ]
