###########################################################
# Тимчасове рішення проблеми із тим,що повідомлення про помилку не відображаються у формі
# Суть рішення в тому,що у текст повідомлення методу messages.error передається
# Перше значення словника form.errors, який містить набір повідомлень про помилку
# Для всіх полів,якщо такі є
###########################################################
def handle_error_messages_service(form_errors: dict):
    first_error_message = list(form_errors.values())[0]
    return ''.join(first_error_message)
